; domain
(define (domain driverlog)
  (:requirements :typing :fluents)
  (:types
    location locatable - object
    driver truck obj - locatable
  )

  (:predicates
    (at ?obj - locatable ?loc - location)
    (in ?obj1 - obj ?obj - truck)
    (driving ?d - driver ?v - truck)
    (link ?x - location ?y - location)
    (path ?x - location ?y - location)
    (empty ?v - truck)
  )
  (:functions
    (time-to-walk ?l1 - location ?l2 - location)
    (time-to-drive ?l1 - location ?l2 - location)
    (driven)
    (walked)
  )

  (:action LOAD-TRUCK
    :parameters (?obj - obj ?truck - truck ?loc - location)
    :precondition (and
      (at ?truck ?loc)
      (at ?obj ?loc))
    :effect (and (not (at ?obj ?loc)) (in ?obj ?truck))
  )

  (:action UNLOAD-TRUCK
    :parameters (?obj - obj ?truck - truck ?loc - location)
    :precondition (and (at ?truck ?loc) (in ?obj ?truck))
    :effect (and (not (in ?obj ?truck)) (at ?obj ?loc))
  )

  (:action BOARD-TRUCK
    :parameters (?driver - driver ?truck - truck ?loc - location)
    :precondition (and (at ?truck ?loc) (at ?driver ?loc) (empty ?truck))
    :effect (and (not (at ?driver ?loc)) (driving ?driver ?truck) (not (empty ?truck)))
  )

  (:action DISEMBARK-TRUCK
    :parameters (?driver - driver ?truck - truck ?loc - location)
    :precondition (and (at ?truck ?loc) (driving ?driver ?truck))
    :effect (and (not (driving ?driver ?truck)) (at ?driver ?loc) (empty ?truck))
  )

  (:action DRIVE-TRUCK
    :parameters (?truck - truck ?loc-from - location ?loc-to - location ?driver - driver)
    :precondition (and (at ?truck ?loc-from)
      (driving ?driver ?truck) (link ?loc-from ?loc-to))
    :effect (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)
      (increase
        (driven)
        (time-to-drive ?loc-from ?loc-to)))
  )

  (:action WALK
    :parameters (?driver - driver ?loc-from - location ?loc-to - location)
    :precondition (and (at ?driver ?loc-from) (path ?loc-from ?loc-to))
    :effect (and (not (at ?driver ?loc-from)) (at ?driver ?loc-to)
      (increase
        (walked)
        (time-to-walk ?loc-from ?loc-to)))
  )

)

; problem
(define (problem DLOG-2-2-9)
	(:domain driverlog)
	(:objects
	driver1 - driver
	driver2 - driver
	truck1 - truck
	truck2 - truck
	package1 - obj
	package2 - obj
	package3 - obj
	package4 - obj
	package5 - obj
	package6 - obj
	package7 - obj
	package8 - obj
	package9 - obj
	s0 - location
	s1 - location
	s2 - location
	p1-0 - location
	p1-2 - location
	p2-0 - location
	p2-1 - location
	)
	(:init
	(at driver1 s1)
	(at driver2 s1)
	(at truck1 s2)
	(empty truck1)
	(at truck2 s0)
	(empty truck2)
	(at package1 s1)
	(at package2 s2)
	(at package3 s2)
	(at package4 s0)
	(at package5 s2)
	(at package6 s1)
	(at package7 s1)
	(at package8 s1)
	(at package9 s0)
	(path s1 p1-0)
	(path p1-0 s1)
	(path s0 p1-0)
	(path p1-0 s0)
	(= (time-to-walk s1 p1-0) 41)
	(= (time-to-walk p1-0 s1) 41)
	(= (time-to-walk s0 p1-0) 2)
	(= (time-to-walk p1-0 s0) 2)
	(path s1 p1-2)
	(path p1-2 s1)
	(path s2 p1-2)
	(path p1-2 s2)
	(= (time-to-walk s1 p1-2) 10)
	(= (time-to-walk p1-2 s1) 10)
	(= (time-to-walk s2 p1-2) 96)
	(= (time-to-walk p1-2 s2) 96)
	(path s2 p2-0)
	(path p2-0 s2)
	(path s0 p2-0)
	(path p2-0 s0)
	(= (time-to-walk s2 p2-0) 49)
	(= (time-to-walk p2-0 s2) 49)
	(= (time-to-walk s0 p2-0) 41)
	(= (time-to-walk p2-0 s0) 41)
	(link s0 s1)
	(link s1 s0)
	(= (time-to-drive s0 s1) 97)
	(= (time-to-drive s1 s0) 97)
	(link s1 s2)
	(link s2 s1)
	(= (time-to-drive s1 s2) 41)
	(= (time-to-drive s2 s1) 41)
	(link s2 s0)
	(link s0 s2)
	(= (time-to-drive s2 s0) 1)
	(= (time-to-drive s0 s2) 1)
	(= (driven) 0)
	(= (walked) 0)
)
	(:goal (and
	(at driver1 s0)
	(at driver2 s0)
	(at truck2 s0)
	(at package2 s1)
	(at package3 s1)
	(at package4 s1)
	(at package5 s1)
	(at package6 s2)
	(at package8 s2)
	(at package9 s2)
	))

(:metric minimize (+ (+ (* 1  (total-time)) (* 1  (driven))) (* 3  (walked))))

)

; plan
1. (walk driver2 s1 p1-0)
   deleted: (at driver2 s1)
   added: (at driver2 p1-0)
   changed: (walked) from 0 to 41
   goals met: 1 of 10
2. (walk driver2 p1-0 s0)
   deleted: (at driver2 p1-0)
   added: (at driver2 s0)
   changed: (walked) from 41 to 43
   goals met: 2 of 10
3. (walk driver1 s1 p1-0)
   deleted: (at driver1 s1)
   added: (at driver1 p1-0)
   changed: (walked) from 43 to 84
   goals met: 2 of 10
4. (load-truck package4 truck2 s0)
   deleted: (at package4 s0)
   added: (in package4 truck2)
   goals met: 2 of 10
5. (load-truck package9 truck2 s0)
   deleted: (at package9 s0)
   added: (in package9 truck2)
   goals met: 2 of 10
6. (walk driver1 p1-0 s0)
   deleted: (at driver1 p1-0)
   added: (at driver1 s0)
   changed: (walked) from 84 to 86
   goals met: 3 of 10
7. (board-truck driver2 truck2 s0)
   deleted: (at driver2 s0) (empty truck2)
   added: (driving driver2 truck2)
   goals met: 2 of 10
8. (drive-truck truck2 s0 s1 driver2)
   deleted: (at truck2 s0)
   added: (at truck2 s1)
   changed: (driven) from 0 to 97
   goals met: 1 of 10
9. (unload-truck package4 truck2 s1)
   deleted: (in package4 truck2)
   added: (at package4 s1)
   goals met: 2 of 10
10. (load-truck package6 truck2 s1)
   deleted: (at package6 s1)
   added: (in package6 truck2)
   goals met: 2 of 10
11. (load-truck package8 truck2 s1)
   deleted: (at package8 s1)
   added: (in package8 truck2)
   goals met: 2 of 10
12. (drive-truck truck2 s1 s2 driver2)
   deleted: (at truck2 s1)
   added: (at truck2 s2)
   changed: (driven) from 97 to 138
   goals met: 2 of 10
13. (unload-truck package6 truck2 s2)
   deleted: (in package6 truck2)
   added: (at package6 s2)
   goals met: 3 of 10
14. (unload-truck package8 truck2 s2)
   deleted: (in package8 truck2)
   added: (at package8 s2)
   goals met: 4 of 10
15. (unload-truck package9 truck2 s2)
   deleted: (in package9 truck2)
   added: (at package9 s2)
   goals met: 5 of 10
16. (load-truck package2 truck2 s2)
   deleted: (at package2 s2)
   added: (in package2 truck2)
   goals met: 5 of 10
17. (load-truck package3 truck2 s2)
   deleted: (at package3 s2)
   added: (in package3 truck2)
   goals met: 5 of 10
18. (load-truck package5 truck2 s2)
   deleted: (at package5 s2)
   added: (in package5 truck2)
   goals met: 5 of 10
19. (drive-truck truck2 s2 s1 driver2)
   deleted: (at truck2 s2)
   added: (at truck2 s1)
   changed: (driven) from 138 to 179
   goals met: 5 of 10
20. (unload-truck package2 truck2 s1)
   deleted: (in package2 truck2)
   added: (at package2 s1)
   goals met: 6 of 10
21. (unload-truck package3 truck2 s1)
   deleted: (in package3 truck2)
   added: (at package3 s1)
   goals met: 7 of 10
22. (unload-truck package5 truck2 s1)
   deleted: (in package5 truck2)
   added: (at package5 s1)
   goals met: 8 of 10
23. (drive-truck truck2 s1 s0 driver2)
   deleted: (at truck2 s1)
   added: (at truck2 s0)
   changed: (driven) from 179 to 276
   goals met: 9 of 10
24. (disembark-truck driver2 truck2 s0)
   deleted: (driving driver2 truck2)
   added: (at driver2 s0) (empty truck2)
   goals met: 10 of 10
